In [3]:
import sqlalchemy as db
from getpass import getpass

In [4]:
password = getpass("Mysql Password: ")

Mysql Password: ········

In [5]:
dbName = "publications"
connectionData = f"mysql+pymysql://root:{password}@localhost/{dbName}"

In [6]:
engine = db.create_engine(connectionData)
print("Connected to server!")

Connected to server!

In [7]:
import pandas as pd

# Challengue 1:

In [14]:
dfs1 = pd.read_sql_query("""
SELECT authors.au_id AS `AUTHOR ID`, titles.title_id AS `TITLE_ID`, SUM(titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100) AS sales_royalty
    FROM titleauthor 
    INNER JOIN authors ON titleauthor.au_id=authors.au_id
    INNER JOIN titles ON titles.title_id=titleauthor.title_id
    INNER JOIN sales ON titles.title_id=sales.title_id
    GROUP BY authors.au_id, titles.title_id
    ORDER BY sales_royalty DESC
    """, engine)

In [15]:
display(dfs1)

      AUTHOR ID TITLE_ID  sales_royalty
0   238-95-7766   PC1035        110.160
1   807-91-6654   TC3218         83.800
2   899-46-2035   PS2091         70.956
3   998-72-3567   PS2091         70.956
4   427-17-2319   PC8888         50.000
5   846-92-7186   PC8888         50.000
6   648-92-1872   TC4203         33.460
7   756-30-7391   PS1372         32.385
8   274-80-9391   BU7832         29.985
9   172-32-1176   PS3333         29.985
10  213-46-8915   BU2075         25.116
11  712-45-1867   MC2222         23.988
12  722-51-5454   MC3021         21.528
13  486-29-1786   PS7777         19.975
14  409-56-7008   BU1032         17.991
15  724-80-9391   BU1111         17.925
16  998-72-3567   PS2106         17.500
17  213-46-8915   BU1032         11.994
18  672-71-3249   TC7777         11.992
19  267-41-2394   BU1111         11.950
20  724-80-9391   PS1372         10.795
21  472-27-2349   TC7777          8.994
22  267-41-2394   TC7777          8.994
23  899-46-2035   MC3021          7.176

In [9]:
dfs2 = pd.read_sql_query("""
SELECT authors.au_id AS `AUTHOR ID`, titles.title_id AS `TITLE_ID`, SUM(titles.advance*titleauthor.royaltyper/100 + titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100) AS TOTAL
    FROM titleauthor
    INNER JOIN authors ON titleauthor.au_id=authors.au_id
    INNER JOIN titles ON titles.title_id=titleauthor.title_id
    INNER JOIN sales ON titles.title_id=sales.title_id
    GROUP BY authors.au_id, titles.title_id
    ORDER BY TOTAL DESC;
    """, engine)

In [10]:
display(dfs2)

      AUTHOR ID TITLE_ID      TOTAL
0   722-51-5454   MC3021  22521.528
1   213-46-8915   BU2075  10150.116
2   899-46-2035   MC3021   7507.176
3   238-95-7766   PC1035   7110.160
4   807-91-6654   TC3218   7083.800
5   409-56-7008   BU1032   6017.991
6   998-72-3567   PS2106   6017.500
7   756-30-7391   PS1372   5282.385
8   274-80-9391   BU7832   5029.985
9   899-46-2035   PS2091   4620.956
10  998-72-3567   PS2091   4620.956
11  846-92-7186   PC8888   4050.000
12  427-17-2319   PC8888   4050.000
13  648-92-1872   TC4203   4033.460
14  486-29-1786   PS7777   4019.975
15  213-46-8915   BU1032   4011.994
16  672-71-3249   TC7777   3211.992
17  724-80-9391   BU1111   3017.925
18  472-27-2349   TC7777   2408.994
19  267-41-2394   TC7777   2408.994
20  172-32-1176   PS3333   2029.985
21  267-41-2394   BU1111   2011.950
22  724-80-9391   PS1372   1760.795
23  712-45-1867   MC2222     23.988

In [19]:
dfs3 = pd.read_sql_query("""
SELECT authors.au_id AS `AUTHOR ID`,SUM(titles.advance*titleauthor.royaltyper/100 + titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100) AS TOTAL
    FROM titleauthor
    INNER JOIN authors ON titleauthor.au_id=authors.au_id
    INNER JOIN titles ON titles.title_id=titleauthor.title_id
    INNER JOIN sales ON titles.title_id=sales.title_id
    GROUP BY authors.au_id
    LIMIT 3;
    """, engine)

In [20]:
display(dfs3)

     AUTHOR ID      TOTAL
0  172-32-1176   2029.985
1  213-46-8915  14162.110
2  238-95-7766   7110.160

# Challengue 2:

In [ ]:
df2 = pd.read_sql_query("""
CREATE TEMPORARY TABLE temp(
SELECT authors.au_id AS `AUTHOR ID`, titles.title_id AS `TITLE_ID`, SUM(titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100) AS sales_royalty
FROM titleauthor 
INNER JOIN authors ON titleauthor.au_id=authors.au_id
INNER JOIN titles ON titles.title_id=titleauthor.title_id
INNER JOIN sales ON titles.title_id=sales.title_id
GROUP BY authors.au_id, titles.title_id
ORDER BY sales_royalty DESC
);
    """, engine)

In [1]:
df2 = pd.read_sql_query("""
SELECT * FROM publications.temp;
   """, engine)

NameError: name 'pd' is not defined

# Challengue 3:

In [ ]:
df3 = pd.read_sql_query("""
CREATE TABLE most_profiting_authors(
SELECT authors.au_id, SUM(titles.advance*titleauthor.royaltyper/100 + titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100) AS profit
	FROM titleauthor
	INNER JOIN authors ON titleauthor.au_id=authors.au_id
	INNER JOIN titles ON titles.title_id=titleauthor.title_id
	INNER JOIN sales ON titles.title_id=sales.title_id
	GROUP BY authors.au_id
ORDER BY profit DESC
);
    """, engine)

In [24]:
df3m = pd.read_sql_query("""
SELECT * FROM publications.most_profiting_authors;
   """, engine)

In [25]:
display(df3m)

          au_id     profit
0   722-51-5454  22521.528
1   213-46-8915  14162.110
2   899-46-2035  12128.132
3   998-72-3567  10638.456
4   238-95-7766   7110.160
5   807-91-6654   7083.800
6   409-56-7008   6017.991
7   756-30-7391   5282.385
8   274-80-9391   5029.985
9   724-80-9391   4778.720
10  267-41-2394   4420.944
11  846-92-7186   4050.000
12  427-17-2319   4050.000
13  648-92-1872   4033.460
14  486-29-1786   4019.975
15  672-71-3249   3211.992
16  472-27-2349   2408.994
17  172-32-1176   2029.985
18  712-45-1867     23.988